aws-samples/aws-stm32-ml-at-edge-accelerator/stm32/tools/svd/STM32U5xx.svd
        <register>
          <name>FLASH_SECWM1R1</name>
          <displayName>FLASH_SECWM1R1</displayName>
          <description>FLASH secure watermark1 register 1 </description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0xFF00FF00</resetValue>
          <resetMask>0xFF00FF00</resetMask>
          <fields>
            <field>
              <name>SECWM1_PSTRT</name>
              <description>Start page of first secure area
This field contains the first page of the secure area in bank 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SECWM1_PEND</name>
              <description>End page of first secure area
This field contains the last page of the secure area in bank 1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SECWM1R2</name>
          <displayName>FLASH_SECWM1R2</displayName>
          <description>FLASH secure watermark1 register 2 </description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <resetValue>0x0F00FFFF</resetValue>
          <resetMask>0x0F00FFFF</resetMask>
          <fields>
            <field>
              <name>HDP1_PEND</name>
              <description>End page of first hide protection area
This field contains the last page of the HDP area in bank 1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HDP1EN</name>
              <description>Hide protection first area enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No HDP area 1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>HDP first area enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_WRP1AR</name>
          <displayName>FLASH_WRP1AR</displayName>
          <description>FLASH WRP1 area A address register </description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <resetValue>0x0F00FF00</resetValue>
          <resetMask>0x0F00FF00</resetMask>
          <fields>
            <field>
              <name>WRP1A_PSTRT</name>
              <description>bank 1 WPR first area A start page
This field contains the first page of the first WPR area for bank 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRP1A_PEND</name>
              <description>Bank 1 WPR first area A end page
This field contains the last page of the first WPR area in bank 1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCK</name>
              <description>Bank 1 WPR first area A unlock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>WRP1A start and end pages locked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>WRP1A start and end pages unlocked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_WRP1BR</name>
          <displayName>FLASH_WRP1BR</displayName>
          <description>FLASH WRP1 area B address register </description>
          <addressOffset>0x5c</addressOffset>
          <size>0x20</size>
          <resetValue>0x0F00FF00</resetValue>
          <resetMask>0x0F00FF00</resetMask>
          <fields>
            <field>
              <name>WRP1B_PSTRT</name>
              <description>Bank 1 WRP second area B start page
This field contains the first page of the second WRP area for bank 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRP1B_PEND</name>
              <description>Bank 1 WRP second area B end page
This field contains the last page of the second WRP area in bank 1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCK</name>
              <description>Bank 1 WPR second area B unlock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>WRP1B start and end pages locked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>WRP1B start and end pages unlocked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SECWM2R1</name>
          <displayName>FLASH_SECWM2R1</displayName>
          <description>FLASH secure watermark2 register 1 </description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0xFF00FF00</resetValue>
          <resetMask>0xFF00FF00</resetMask>
          <fields>
            <field>
              <name>SECWM2_PSTRT</name>
              <description>Start page of second secure area
This field contains the first page of the secure area in bank 2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SECWM2_PEND</name>
              <description>End page of second secure area
This field contains the last page of the secure area in bank 2.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SECWM2R2</name>
          <displayName>FLASH_SECWM2R2</displayName>
          <description>FLASH secure watermark2 register 2 </description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x0F00FFFF</resetValue>
          <resetMask>0x0F00FFFF</resetMask>
          <fields>
            <field>
              <name>HDP2_PEND</name>
              <description>End page of hide protection second area
HDP2_PEND contains the last page of the HDP area in bank 2.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HDP2EN</name>
              <description>Hide protection second area enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No HDP area 2</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>HDP second area is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_WRP2AR</name>
          <displayName>FLASH_WRP2AR</displayName>
          <description>FLASH WPR2 area A address register </description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x0F00FF00</resetValue>
          <resetMask>0x0F00FF00</resetMask>
          <fields>
            <field>
              <name>WRP2A_PSTRT</name>
              <description>Bank 2 WPR first area A start page
This field contains the first page of the first WRP area for bank 2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRP2A_PEND</name>
              <description>Bank 2 WPR first area A end page
This field contains the last page of the first WRP area in bank 2.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCK</name>
              <description>Bank 2 WPR first area A unlock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>WRP2A start and end pages locked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>WRP2A start and end pages unlocked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_WRP2BR</name>
          <displayName>FLASH_WRP2BR</displayName>
          <description>FLASH WPR2 area B address register </description>
          <addressOffset>0x6c</addressOffset>
          <size>0x20</size>
          <resetValue>0x0F00FF00</resetValue>
          <resetMask>0x0F00FF00</resetMask>
          <fields>
            <field>
              <name>WRP2B_PSTRT</name>
              <description>Bank 2 WPR second area B start page
This field contains the first page of the second WRP area for bank 2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRP2B_PEND</name>
              <description>Bank 2 WPR second area B end page
This field contains the last page of the second WRP area in bank 2.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCK</name>
              <description>Bank 2 WPR second area B unlock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>WRP2B start and end pages locked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>WRP2B start and end pages unlocked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_OEM1KEYR1</name>
          <displayName>FLASH_OEM1KEYR1</displayName>
          <description>FLASH OEM1 key register 1 </description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OEM1KEY</name>
              <description>OEM1 least significant bytes key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_OEM1KEYR2</name>
          <displayName>FLASH_OEM1KEYR2</displayName>
          <description>FLASH OEM1 key register 2 </description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OEM1KEY</name>
              <description>OEM1 most significant bytes key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_OEM2KEYR1</name>
          <displayName>FLASH_OEM2KEYR1</displayName>
          <description>FLASH OEM2 key register 1 </description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OEM2KEY</name>
              <description>OEM2 least significant bytes key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_OEM2KEYR2</name>
          <displayName>FLASH_OEM2KEYR2</displayName>
          <description>FLASH OEM2 key register 2 </description>
          <addressOffset>0x7c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OEM2KEY</name>
              <description>OEM2 most significant bytes key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
