aws-samples/aws-stm32-ml-at-edge-accelerator/stm32/tools/svd/STM32U5xx.svd
          <register>
            <name>ADC_GCOMP</name>
            <displayName>ADC_GCOMP</displayName>
            <description>ADC gain compensation register </description>
            <addressOffset>0x70</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>GCOMPCOEFF</name>
                <description>Gain compensation coefficient
These bits are set and cleared by software to program the gain compensation coefficient.
...
...
The coefficient is divided by 4096 to get the gain factor ranging from 0 to 3.999756.
Note: This gain compensation is only applied when GCOMP bit of ADCx_CFGR2 register is 1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>14</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x800</name>
                    <description>gain factor of 0.5</description>
                    <value>0x800</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1000</name>
                    <description>gain factor of 1</description>
                    <value>0x1000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2000</name>
                    <description>gain factor of 2</description>
                    <value>0x2000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3000</name>
                    <description>gain factor of 3</description>
                    <value>0x3000</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GCOMP</name>
                <description>Gain compensation mode
This bit is set and cleared by software to enable the gain compensation mode.
Note: The software is allowed to write this bit only when ADSTART = 0 (which ensures that no conversion is ongoing).</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Regular ADC operating mode </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Gain compensation enabled and applied on all channels</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ADC_JDR1</name>
            <displayName>ADC_JDR1</displayName>
            <description>ADC injected data register </description>
            <addressOffset>0x80</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>JDATA</name>
                <description>Injected data
These bits are read-only. They contain the conversion result from injected channel y. The data are left -or right-aligned as described in .</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADC_JDR2</name>
            <displayName>ADC_JDR2</displayName>
            <description>ADC injected data register </description>
            <addressOffset>0x84</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>JDATA</name>
                <description>Injected data
These bits are read-only. They contain the conversion result from injected channel y. The data are left -or right-aligned as described in .</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADC_JDR3</name>
            <displayName>ADC_JDR3</displayName>
            <description>ADC injected data register </description>
            <addressOffset>0x88</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>JDATA</name>
                <description>Injected data
These bits are read-only. They contain the conversion result from injected channel y. The data are left -or right-aligned as described in .</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADC_JDR4</name>
            <displayName>ADC_JDR4</displayName>
            <description>ADC injected data register </description>
            <addressOffset>0x8c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>JDATA</name>
                <description>Injected data
These bits are read-only. They contain the conversion result from injected channel y. The data are left -or right-aligned as described in .</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADC_AWD2CR</name>
            <displayName>ADC_AWD2CR</displayName>
            <description>ADC analog watchdog 2 configuration register	</description>
            <addressOffset>0xa0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AWD2CH</name>
                <description>Analog watchdog 2 channel selection
These bits are set and cleared by software. They enable and select the input channels to be guarded by the analog watchdog 2.
AWD2CH[i] = 0: ADC analog input channel-i is not monitored by AWD2
AWD2CH[i] = 1: ADC analog input channel-i is monitored by AWD2
When AWD2CH[19:0] = 000..0, the analog Watchdog 2 is disabled
Note: The channels selected by AWD2CH must be also selected into the SQRi or JSQRi registers.
Software is allowed to write these bits only when ADSTART = 0 and JADSTART = 0 (which ensures that no conversion is ongoing).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADC_AWD3CR</name>
            <displayName>ADC_AWD3CR</displayName>
            <description>ADC analog watchdog 3 configuration register	</description>
            <addressOffset>0xa4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AWD3CH</name>
                <description>Analog watchdog 3 channel selection
These bits are set and cleared by software. They enable and select the input channels to be guarded by the analog watchdog 3.
AWD3CH[i] = 0: ADC analog input channel-i is not monitored by AWD3
AWD3CH[i] = 1: ADC analog input channel-i is monitored by AWD3
When AWD3CH[19:0] = 000..0, the analog Watchdog 3 is disabled
Note: The channels selected by AWD3CH must be also selected into the SQRi or JSQRi registers.
The software is allowed to write these bits only when ADSTART = 0 and JADSTART = 0 (which ensures that no conversion is ongoing).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADC_LTR1</name>
            <displayName>ADC_LTR1</displayName>
            <description>ADC watchdog threshold register 1 </description>
            <addressOffset>0xa8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LTR1</name>
                <description>Analog watchdog 1 lower threshold
These bits are written by software to define the lower threshold for the analog watchdog 1.
Refer to AWD2CH, AWD3CH, AWD_HTRy, AWD_LTRy, AWDy).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>25</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADC_HTR1</name>
            <displayName>ADC_HTR1</displayName>
            <description>ADC watchdog threshold register 1 </description>
            <addressOffset>0xac</addressOffset>
            <size>0x20</size>
            <resetValue>0x01FFFFFF</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HTR1</name>
                <description>Analog watchdog 1 higher threshold
These bits are written by software to define the higher threshold for the analog watchdog 1.
Refer to AWD2CH, AWD3CH, AWD_HTRy, AWD_LTRy, AWDy).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>25</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AWDFILT1</name>
                <description>Analog watchdog filtering parameter
This bit is set and cleared by software.
...
Note: The software is allowed to write this bit only when ADSTART = 0 and JADSTART = 0 (which ensures that no conversion is ongoing).</description>
                <bitOffset>29</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No filtering </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>two consecutive detection generates an AWDx flag or an interrupt</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7</name>
                    <description>Eight consecutive detection generates an AWDx flag or an interrupt</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ADC_LTR2</name>
            <displayName>ADC_LTR2</displayName>
            <description>ADC watchdog lower threshold register 2 </description>
            <addressOffset>0xb0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LTR2</name>
                <description>Analog watchdog 2 lower threshold
These bits are written by software to define the lower threshold for the analog watchdog 2.
Refer to AWD2CH, AWD3CH, AWD_HTRy, AWD_LTRy, AWDy).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>25</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADC_HTR2</name>
            <displayName>ADC_HTR2</displayName>
            <description>ADC watchdog higher threshold register 2 </description>
            <addressOffset>0xb4</addressOffset>
            <size>0x20</size>
            <resetValue>0x01FFFFFF</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HTR2</name>
                <description>Analog watchdog 2 higher threshold
These bits are written by software to define the higher threshold for the analog watchdog 2.
Refer to AWD2CH, AWD3CH, AWD_HTRy, AWD_LTRy, AWDy).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>25</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADC_LTR3</name>
            <displayName>ADC_LTR3</displayName>
            <description>ADC watchdog lower threshold register 3 </description>
            <addressOffset>0xb8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LTR3</name>
                <description>Analog watchdog 3 lower threshold
These bits are written by software to define the lower threshold for the analog watchdog 3.
Refer to AWD2CH, AWD3CH, AWD_HTRy, AWD_LTRy, AWDy).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>25</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADC_HTR3</name>
            <displayName>ADC_HTR3</displayName>
            <description>ADC watchdog higher threshold register 3 </description>
            <addressOffset>0xbc</addressOffset>
            <size>0x20</size>
            <resetValue>0x01FFFFFF</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HTR3</name>
                <description>Analog watchdog 3 higher threshold
These bits are written by software to define the higher threshold for the analog watchdog 3.
Refer to AWD2CH, AWD3CH, AWD_HTRy, AWD_LTRy, AWDy).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>25</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADC_DIFSEL</name>
            <displayName>ADC_DIFSEL</displayName>
            <description>ADC differential mode selection register </description>
            <addressOffset>0xc0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DIFSEL</name>
                <description>Differential mode for channels 19 to 0
These bits are set and cleared by software. They allow selecting if a channel is configured as single ended or differential mode.
DIFSEL[i] = 0: ADC analog input channel-i is configured in single ended mode
DIFSEL[i] = 1: ADC analog input channel-i is configured in differential mode
Note: The software is allowed to write these bits only when the ADC is disabled (ADCAL = 0, JADSTART = 0, JADSTP = 0, ADSTART = 0, ADSTP = 0, ADDIS = 0 and ADEN = 0).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADC_CALFACT</name>
            <displayName>ADC_CALFACT</displayName>
            <description>ADC user control register </description>
            <addressOffset>0xc4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>I_APB_ADDR</name>
                <description>Delayed write access address
This bitfield contains the address that is being written during delayed write accesses.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>I_APB_DATA</name>
                <description>Delayed write access data
This bitfield contains the data that are being written during delayed write accesses.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>VALIDITY</name>
                <description>Delayed write access status bit
This bit indicates the communication status between the ADC digital and analog blocks.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Operation still in progress</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Operation complete</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LATCH_COEF</name>
                <description>Calibration factor latch enable bit
This bit latches the calibration factor in the CALFACT[31:0] bits.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Calibration factor latched in the analog block on LATCH_COEF bit transition from 0 to 1. Prior to latching the calibration factor, CALFACT[31:0] bits must be programmed with the content of CALINDEX[3:0] bits.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CAPTURE_COEF</name>
                <description>Calibration factor capture enable bit
This bit enables the internal calibration factor capture.</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Calibration factor not captured</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Calibration factor available in CALFACT[31:0] bits, the calibration factor index being defined by CALINDEX[3:0] bits </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ADC_CALFACT2</name>
            <displayName>ADC_CALFACT2</displayName>
            <description>ADC calibration factor register </description>
            <addressOffset>0xc8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CALFACT</name>
                <description>Linearity or offset calibration factor
These bits can be written either by hardware or by software.
They contain the 32-bit offset or linearity calibration factor.
When CAPTURE_COEF is set to 1, the calibration factor of the analog block is read back and stored in CALFACT[31:0], indexed by CALINDEX[3:0] bits.
When LATCH_COEF is set to 1, the calibration factor of the analog block is updated with the value programmed in CALFACT[31:0], indexed by CALINDEX[3:0] bits.
To read all calibration factors, perform nine accesses to the ADC_CALFACT2 register.
To write all calibration factors, perform eight accesses to the ADC_CALFACT2 register.
Note: The software is allowed to write these bits only when ADEN = 1, ADSTART = 0 and JADSTART = 0 (ADC is enabled and no calibration is ongoing and no conversion is ongoing).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
