aws-samples/aws-stm32-ml-at-edge-accelerator/stm32/tools/svd/STM32U5xx.svd
        <!-- <register> -->
        <!-- <name>DEACHINT</name> -->
        <!-- <displayName>DEACHINT</displayName> -->
        <!-- <description>OTG device each endpoint interrupt register</description> -->
        <!-- <addressOffset>0x838</addressOffset> -->
        <!-- <size>0x20</size> -->
        <!-- <access>read-only</access> -->
        <!-- <resetValue>0x00000000</resetValue> -->
        <!-- <fields> -->
        <!-- <field> -->
        <!-- <name>IEP1INT</name> -->
        <!-- <description>IEP1INT</description> -->
        <!-- <bitOffset>1</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- <field> -->
        <!-- <name>OEP1INT</name> -->
        <!-- <description>OEP1INT</description> -->
        <!-- <bitOffset>17</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- </fields> -->
        <!-- </register> -->
        <!-- <register> -->
        <!-- <name>DEACHINTMSK</name> -->
        <!-- <displayName>DEACHINTMSK</displayName> -->
        <!-- <description>There is one interrupt bit for endpoint 1 IN and one interrupt bit for endpoint 1 OUT.</description> -->
        <!-- <addressOffset>0x83C</addressOffset> -->
        <!-- <size>0x20</size> -->
        <!-- <access>read-write</access> -->
        <!-- <resetValue>0x00000000</resetValue> -->
        <!-- <fields> -->
        <!-- <field> -->
        <!-- <name>IEP1INTM</name> -->
        <!-- <description>IEP1INTM</description> -->
        <!-- <bitOffset>1</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- <field> -->
        <!-- <name>OEP1INTM</name> -->
        <!-- <description>OEP1INTM</description> -->
        <!-- <bitOffset>17</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- </fields> -->
        <!-- </register> -->
        <!-- <register> -->
        <!-- <name>HS_DIEPEACHMSK1</name> -->
        <!-- <displayName>HS_DIEPEACHMSK1</displayName> -->
        <!-- <description>This register works with the DIEPINT1 register to generate a dedicated interrupt HS_EP1_IN for endpoint #1. The IN endpoint interrupt for a specific status in the DOEPINT1 register can be masked by writing into the corresponding bit in this register. Status bits are masked by default.</description> -->
        <!-- <addressOffset>0x844</addressOffset> -->
        <!-- <size>0x20</size> -->
        <!-- <access>read-write</access> -->
        <!-- <resetValue>0x00000000</resetValue> -->
        <!-- <fields> -->
        <!-- <field> -->
        <!-- <name>XFRCM</name> -->
        <!-- <description>XFRCM</description> -->
        <!-- <bitOffset>0</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- <field> -->
        <!-- <name>EPDM</name> -->
        <!-- <description>EPDM</description> -->
        <!-- <bitOffset>1</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- <field> -->
        <!-- <name>AHBERRM</name> -->
        <!-- <description>AHBERRM</description> -->
        <!-- <bitOffset>2</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- <field> -->
        <!-- <name>TOM</name> -->
        <!-- <description>TOM</description> -->
        <!-- <bitOffset>3</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- <field> -->
        <!-- <name>ITTXFEMSK</name> -->
        <!-- <description>ITTXFEMSK</description> -->
        <!-- <bitOffset>4</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- <field> -->
        <!-- <name>INEPNEM</name> -->
        <!-- <description>INEPNEM</description> -->
        <!-- <bitOffset>6</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- <field> -->
        <!-- <name>TXFURM</name> -->
        <!-- <description>TXFURM</description> -->
        <!-- <bitOffset>8</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- <field> -->
        <!-- <name>BNAM</name> -->
        <!-- <description>BNAM</description> -->
        <!-- <bitOffset>9</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- <field> -->
        <!-- <name>NAKM</name> -->
        <!-- <description>NAKM</description> -->
        <!-- <bitOffset>13</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- </fields> -->
        <!-- </register> -->
        <!-- <register> -->
        <!-- <name>HS_DOEPEACHMSK1</name> -->
        <!-- <displayName>HS_DOEPEACHMSK1</displayName> -->
        <!-- <description>This register works with the DOEPINT1 register to generate a dedicated interrupt HS_EP1_OUT for endpoint #1. The OUT endpoint interrupt for a specific status in the DOEPINT1 register can be masked by writing into the corresponding bit in this register. Status bits are masked by default.</description> -->
        <!-- <addressOffset>0x884</addressOffset> -->
        <!-- <size>0x20</size> -->
        <!-- <access>read-write</access> -->
        <!-- <resetValue>0x00000000</resetValue> -->
        <!-- <fields> -->
        <!-- <field> -->
        <!-- <name>XFRCM</name> -->
        <!-- <description>XFRCM</description> -->
        <!-- <bitOffset>0</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- <field> -->
        <!-- <name>EPDM</name> -->
        <!-- <description>EPDM</description> -->
        <!-- <bitOffset>1</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- <field> -->
        <!-- <name>AHBERRM</name> -->
        <!-- <description>AHBERRM</description> -->
        <!-- <bitOffset>2</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- <field> -->
        <!-- <name>STUPM</name> -->
        <!-- <description>STUPM</description> -->
        <!-- <bitOffset>3</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- <field> -->
        <!-- <name>OTEPDM</name> -->
        <!-- <description>OTEPDM</description> -->
        <!-- <bitOffset>4</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- <field> -->
        <!-- <name>B2BSTUPM</name> -->
        <!-- <description>B2BSTUPM</description> -->
        <!-- <bitOffset>6</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- <field> -->
        <!-- <name>OUTPKTERRM</name> -->
        <!-- <description>OUTPKTERRM</description> -->
        <!-- <bitOffset>8</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- <field> -->
        <!-- <name>BNAM</name> -->
        <!-- <description>BNAM</description> -->
        <!-- <bitOffset>9</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- <field> -->
        <!-- <name>BERRM</name> -->
        <!-- <description>BERRM</description> -->
        <!-- <bitOffset>12</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- <field> -->
        <!-- <name>NAKMSK</name> -->
        <!-- <description>NAKMSK</description> -->
        <!-- <bitOffset>13</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- <field> -->
        <!-- <name>NYETMSK</name> -->
        <!-- <description>NYETMSK</description> -->
        <!-- <bitOffset>14</bitOffset> -->
        <!-- <bitWidth>1</bitWidth> -->
        <!-- </field> -->
        <!-- </fields> -->
        <!-- </register> -->
        <register>
          <name>DIEPCTL0</name>
          <displayName>DIEPCTL0</displayName>
          <description>The application uses this register to control the behavior of each logical endpoint other than endpoint 0.</description>
          <addressOffset>0x900</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MPSIZ</name>
              <description>MPSIZ</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBAEP</name>
              <description>USBAEP</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAKSTS</name>
              <description>NAKSTS</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPTYP</name>
              <description>EPTYP</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL</name>
              <description>STALL</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFNUM</name>
              <description>TXFNUM</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNAK</name>
              <description>CNAK</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SNAK</name>
              <description>SNAK</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EPDIS</name>
              <description>EPDIS</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPENA</name>
              <description>EPENA</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPINT0</name>
          <displayName>DIEPINT0</displayName>
          <description>This register indicates the status of an endpoint with respect to USB- and AHB-related events. It is shown in Figure724. The application must read this register when the IN endpoints interrupt bit of the core interrupt register (IEPINT in GINTSTS) is set. Before the application can read this register, it must first read the device all endpoints interrupt (DAINT) register to get the exact endpoint number for the device endpoint-x interrupt register. The application must clear the appropriate bit in this register to clear the corresponding bits in the DAINT and GINTSTS registers.</description>
          <addressOffset>0x908</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>XFRC</name>
              <description>XFRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISD</name>
              <description>EPDISD</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOC</name>
              <description>TOC</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITTXFE</name>
              <description>ITTXFE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPNM</name>
              <description>INEPNM</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPNE</name>
              <description>INEPNE</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFE</name>
              <description>TXFE</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTDRPSTS</name>
              <description>PKTDRPSTS</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NAK</name>
              <description>NAK</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPTSIZ0</name>
          <displayName>DIEPTSIZ0</displayName>
          <description>The application must modify this register before enabling endpoint 0.</description>
          <addressOffset>0x910</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XFRSIZ</name>
              <description>XFRSIZ</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>PKTCNT</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTXFSTS0</name>
          <displayName>DTXFSTS0</displayName>
          <description>This read-only register contains the free space information for the device IN endpoint Tx FIFO.</description>
          <addressOffset>0x918</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000200</resetValue>
          <fields>
            <field>
              <name>INEPTFSAV</name>
              <description>INEPTFSAV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPCTL1</name>
          <displayName>DIEPCTL1</displayName>
          <description>The application uses this register to control the behavior of each logical endpoint other than endpoint 0.</description>
          <addressOffset>0x920</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MPSIZ</name>
              <description>MPSIZ</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBAEP</name>
              <description>USBAEP</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EONUM_DPIP</name>
              <description>EONUM_DPIP</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAKSTS</name>
              <description>NAKSTS</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPTYP</name>
              <description>EPTYP</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL</name>
              <description>STALL</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFNUM</name>
              <description>TXFNUM</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNAK</name>
              <description>CNAK</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SNAK</name>
              <description>SNAK</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SD0PID_SEVNFRM</name>
              <description>SD0PID_SEVNFRM</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SODDFRM</name>
              <description>SODDFRM</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EPDIS</name>
              <description>EPDIS</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPENA</name>
              <description>EPENA</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPINT1</name>
          <displayName>DIEPINT1</displayName>
          <description>This register indicates the status of an endpoint with respect to USB- and AHB-related events. It is shown in Figure724. The application must read this register when the IN endpoints interrupt bit of the core interrupt register (IEPINT in GINTSTS) is set. Before the application can read this register, it must first read the device all endpoints interrupt (DAINT) register to get the exact endpoint number for the device endpoint-x interrupt register. The application must clear the appropriate bit in this register to clear the corresponding bits in the DAINT and GINTSTS registers.</description>
          <addressOffset>0x928</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>XFRC</name>
              <description>XFRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISD</name>
              <description>EPDISD</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOC</name>
              <description>TOC</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITTXFE</name>
              <description>ITTXFE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPNM</name>
              <description>INEPNM</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPNE</name>
              <description>INEPNE</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFE</name>
              <description>TXFE</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTDRPSTS</name>
              <description>PKTDRPSTS</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NAK</name>
              <description>NAK</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPTSIZ1</name>
          <displayName>DIEPTSIZ1</displayName>
          <description>The application must modify this register before enabling the endpoint. Once the endpoint is enabled using the endpoint enable bit in the DIEPCTLx registers (EPENA bit in DIEPCTLx), the core modifies this register. The application can only read this register once the core has cleared the endpoint enable bit.</description>
          <addressOffset>0x930</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XFRSIZ</name>
              <description>XFRSIZ</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>PKTCNT</description>
              <bitOffset>19</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>MCNT</name>
              <description>MCNT</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPDMA1</name>
          <displayName>DIEPDMA1</displayName>
          <description>OTG device IN endpoint 1 DMA address register</description>
          <addressOffset>0x934</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMAADDR</name>
              <description>DMAADDR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
